monte-monte/ch32v003fun/extralibs/fsusb.c
#include "fsusb.h"
#include "ch32fun.h"
#include <string.h>

struct _USBState USBFSCTX;
volatile uint8_t usb_debug = 0;

// #if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
#if !defined CH5xx && FUSB_USE_DMA7_COPY
static inline void copyBuffer( uint8_t * dest, const uint8_t * src, int len )
{
	while( DMA1_Channel7->CNTR );
	DMA1_Channel7->CFGR = 0;
	DMA1_Channel7->MADDR = (uintptr_t)src;
	DMA1_Channel7->PADDR = (uintptr_t)dest;
	DMA1_Channel7->CNTR  = (len+3)/4;
	DMA1_Channel7->CFGR  =
		DMA_M2M_Enable | 
		DMA_DIR_PeripheralDST |
		DMA_Priority_Low |
		DMA_MemoryDataSize_Word |
		DMA_PeripheralDataSize_Word |
		DMA_MemoryInc_Enable |
		DMA_PeripheralInc_Enable |
		DMA_Mode_Normal | DMA_CFGR1_EN;
#if !( FUSB_CURSED_TURBO_DMA == 1 )
	// Somehow, it seems to work (unsafely) without this.
	// Really, though, it's probably fine.
	while( DMA1_Channel7->CNTR );
#endif
}

static inline void copyBufferComplete() { while( DMA1_Channel7->CNTR ); }
#else
#define copyBuffer memcpy
#define copyBufferComplete() ((void)0)
#endif

#if defined (CH5xx)
#define USBFS_IRQHandler USB_IRQHandler
#endif

#if FUSB_USE_HPE
// There is an issue with some registers apparently getting lost with HPE, just do it the slow way.
void USBFS_IRQHandler() __attribute__((section(".text.vector_handler")))  __attribute((interrupt));
// void USBHD_IRQHandler() __attribute__((section(".text.vector_handler")))  __attribute((naked));
#else
void USBFS_IRQHandler() __attribute__((section(".text.vector_handler")))  __attribute((interrupt));
#endif

void USBFS_InternalFinishSetup();

void USBFS_IRQHandler()
{
#if FUSB_IO_PROFILE
	funDigitalWrite( DEBUG_PIN, 1 );
#endif

	// Combined FG + ST flag.
	uint16_t intfgst = *(uint16_t*)(&USBFS->INT_FG);
	int len = 0;
	struct _USBState * ctx = &USBFSCTX;
	uint8_t * ctrl0buff = CTRL0BUFF;

	// TODO: Check if needs to be do-while to re-check.
	if( intfgst & CRB_UIF_TRANSFER )
	{
    
		int token = ( intfgst & CMASK_UIS_TOKEN) >> 12;
		int ep = ( intfgst & CMASK_UIS_ENDP ) >> 8;
    if( usb_debug ) printf("[USB] transfer, token = %02x, ep = %d, bmRequestType = %02x, bRequest = %02x\n", token, ep, pUSBFS_SetupReqPak->bmRequestType, pUSBFS_SetupReqPak->bRequest);
		switch ( token )
		{
		case CUIS_TOKEN_IN:
			if( ep )
			{
				if( ep < FUSB_CONFIG_EPS )
				{
#if FUSB_USER_HANDLERS
          len = HandleInRequest( ctx, ep, ctx->ENDPOINTS[ ep ], 0 );
#endif    
          UEP_CTRL_TX(ep) ^= USBFS_UEP_T_TOG;
          if( len )
          {
            if( len < 0 ) len = 0;
            UEP_CTRL_LEN( ep ) = len;
            UEP_CTRL_TX(ep) = ( UEP_CTRL_TX(ep) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_ACK;
          }
          else
          {
            UEP_CTRL_TX(ep) = ( UEP_CTRL_TX(ep) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_NAK;
          }
					ctx->USBFS_Endp_Busy[ ep ] = 0;
				}
			}
			else
			{
				/* end-point 0 data in interrupt */
				if( ctx->USBFS_SetupReqLen == 0 )
				{
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
					UEP_CTRL_TX(0) = USBFS_UEP_R_RES_ACK | USBFS_UEP_R_TOG;
#else
					UEP_CTRL_RX(0) = USBFS_UEP_R_RES_ACK | USBFS_UEP_R_TOG;
#endif
				}

				ctx->USBFS_errata_dont_send_endpoint_in_window = 0;

				if( ctx->pCtrlPayloadPtr )
				{
					// Shortcut mechanism, for descriptors or if the user wants it.
					len = ctx->USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE : ctx->USBFS_SetupReqLen;
					copyBuffer( ctrl0buff, ctx->pCtrlPayloadPtr, len ); // FYI -> Would need to do this if using DMA
					ctx->USBFS_SetupReqLen -= len;
					if( ctx->USBFS_SetupReqLen > 0 )
						ctx->pCtrlPayloadPtr += len;
					else
						ctx->pCtrlPayloadPtr = 0;

					UEP_CTRL_LEN(0) = len;
					UEP_CTRL_TX(0) ^= USBFS_UEP_T_TOG;
				}
				else if ( ( ctx->USBFS_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
				{
          len = ctx->USBFS_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE : ctx->USBFS_SetupReqLen;
#if FUSB_HID_USER_REPORTS
					if( len && USBFSCTX.USBFS_SetupReqCode == HID_GET_REPORT )
					{
						len = HandleHidUserReportDataIn( ctx, ctrl0buff, len );
						UEP_CTRL_LEN(0) = len;
						UEP_CTRL_TX(0) ^= USBFS_UEP_T_TOG;
						ctx->USBFS_SetupReqLen -= len;
						ctx->pCtrlPayloadPtr += len;
					}	
#endif
#if FUSB_USER_HANDLERS
          if( len && USBFSCTX.USBFS_SetupReqCode != HID_GET_REPORT )
          {
            len = HandleInRequest( ctx, 0, ctrl0buff, len );
            UEP_CTRL_LEN(0) = len;
						UEP_CTRL_TX(0) ^= USBFS_UEP_T_TOG;
						ctx->USBFS_SetupReqLen -= len;
						ctx->pCtrlPayloadPtr += len;
          }
#endif
				}
				else
				{
					switch( USBFSCTX.USBFS_SetupReqCode )
					{
						case USB_GET_DESCRIPTOR:
							break;

						case USB_SET_ADDRESS:
							USBFS->DEV_ADDR = ( USBFS->DEV_ADDR & USBFS_UDA_GP_BIT ) | ctx->USBFS_DevAddr;
							break;

						default:
							break;
					}
				}
			}
			break;

		/* data-out stage processing */
		case CUIS_TOKEN_OUT:
			switch( ep )
			{
        // len = USBFS->RX_LEN;
				/* end-point 0 data out interrupt */
				case DEF_UEP0:
					if( intfgst & CRB_UIS_TOG_OK )
					{
#if FUSB_HID_USER_REPORTS
            if( ctx->USBFS_SetupReqCode == HID_SET_REPORT )
            {
              int len = USBFS->RX_LEN;
              uint8_t * cptr = ctx->pCtrlPayloadPtr;
              if( !cptr )
              {
                HandleHidUserReportDataOut( ctx, ctrl0buff, len );
              }
              else
              {
                int remain = ctx->USBFS_SetupReqLen - len;
                if( remain < 0 )
                {
                  len += remain;
                  remain = 0;
                }
                copyBuffer( cptr, ctrl0buff, len );
                ctx->USBFS_SetupReqLen = remain;
                if( remain > 0 )
                  ctx->pCtrlPayloadPtr = cptr + len;
                else
                  ctx->pCtrlPayloadPtr = 0;
              }
            }
#endif
#if FUSB_USER_HANDLERS
            if ( ctx->USBFS_SetupReqCode != HID_SET_REPORT )
            {
              HandleDataOut( ctx, ep, ctrl0buff, len );
            }
#endif
						if( ctx->USBFS_SetupReqLen == 0 )
						{
#if FUSB_HID_USER_REPORTS
							copyBufferComplete();
              if( ctx->USBFS_SetupReqCode == HID_SET_REPORT )
							  HandleHidUserReportOutComplete( ctx );
#endif
							ctx->USBFS_errata_dont_send_endpoint_in_window = 1;
							UEP_CTRL_LEN(0) = 0;
							UEP_CTRL_TX(0) = USBFS_UEP_T_TOG | CHECK_USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_RES_ACK;
						}
						else
						{
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
							UEP_CTRL_TX(0) ^= USBFS_UEP_R_TOG;
#else
							UEP_CTRL_RX(0) ^= USBFS_UEP_R_TOG;
#endif
						}
					}
					break;

				default:
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
          UEP_CTRL_TX(ep) ^= USBFS_UEP_R_TOG;
#else
          UEP_CTRL_RX(ep) ^= USBFS_UEP_R_TOG;
#endif
#if FUSB_USER_HANDLERS
          HandleDataOut( ctx, ep, ctx->ENDPOINTS[ep], len );
#endif
					break;
			}
			break;

		/* Setup stage processing */
		case CUIS_TOKEN_SETUP:
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
      if (!(USBFS->INT_ST & 0x80)) goto replycomplete;
			UEP_CTRL_TX(0) = USBFS_UEP_T_RES_NAK | USBFS_UEP_T_TOG | USBFS_UEP_R_RES_NAK | USBFS_UEP_R_TOG | CHECK_USBFS_UEP_AUTO_TOG;
#else
			UEP_CTRL_TX(0) = USBFS_UEP_T_RES_NAK | CHECK_USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_TOG;
			UEP_CTRL_RX(0) = USBFS_UEP_R_RES_NAK | CHECK_USBFS_UEP_R_AUTO_TOG | USBFS_UEP_R_TOG;
#endif

