monte-monte/ch32v003fun/extralibs/fsusb.c
		USBFS->DEV_ADDR = 0;
		USBFS_InternalFinishSetup( );
		USBFS->INT_FG = CRB_UIF_BUS_RST;
	}
	else if( intfgst & CRB_UIF_SUSPEND )
	{
		/* usb suspend interrupt processing */
		if( USBFS->MIS_ST & USBFS_UMS_SUSPEND )
		{
			ctx->USBFS_DevSleepStatus |= 0x02;
			if( ctx->USBFS_DevSleepStatus == 0x03 )
			{
				/* Handling usb sleep here */
				//TODO: MCU_Sleep_Wakeup_Operate( );
			}
		}
		else
		{
			ctx->USBFS_DevSleepStatus &= ~0x02;
		}
		USBFS->INT_FG = USBFS_UMS_SUSPEND;
	}

#if FUSB_IO_PROFILE
	funDigitalWrite( DEBUG_PIN, 0 );
#endif

#if FUSB_USE_HPE
	// asm volatile( "mret" );
#endif
}

void USBFS_InternalFinishSetup()
{
  USBFSCTX.endpoint_dir[1] = 0;
  USBFSCTX.endpoint_dir[2] = 1;
  USBFSCTX.endpoint_dir[3] = 0;
// #if FUSB_CONFIG_EPS > 4
	USBFS->UEP4_1_MOD = USBFS_UEP1_TX_EN;
// #elif FUSB_CONFIG_EPS > 1
	// USBFS->UEP4_1_MOD = USBFS_UEP1_TX_EN | USBFS_UEP4_TX_EN;
// #endif

// #if FUSB_CONFIG_EPS > 3
	USBFS->UEP2_3_MOD = USBFS_UEP2_RX_EN | USBFS_UEP3_TX_EN;
// #elif FUSB_CONFIG_EPS > 2
	// USBFS->UEP2_3_MOD = USBFS_UEP2_TX_EN;
// #endif

#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
	USBFS->UEP567_MOD = 0;
#else
	USBFS->UEP5_6_MOD = 0;
#endif

	// This is really cursed.  Somehow it doesn't explode.
	// But, normally the USB wants a separate buffer here.

#if FUSB_CONFIG_EPS > 4
	USBFS->UEP4_DMA = (uintptr_t)USBFSCTX.ENDPOINTS[4];
#endif
#if FUSB_CONFIG_EPS > 3
	USBFS->UEP3_DMA = (uintptr_t)USBFSCTX.ENDPOINTS[3];
#endif
#if FUSB_CONFIG_EPS > 2
	USBFS->UEP2_DMA = (uintptr_t)USBFSCTX.ENDPOINTS[2];
#endif
#if FUSB_CONFIG_EPS > 1
	USBFS->UEP1_DMA = (uintptr_t)USBFSCTX.ENDPOINTS[1];
#endif
#if FUSB_CONFIG_EPS > 0
	USBFS->UEP0_DMA = (uintptr_t)USBFSCTX.ENDPOINTS[0];
#else
#error You must have at least EP0!
#endif

#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
	UEP_CTRL_TX(0) = USBFS_UEP_T_RES_NAK | USBFS_UEP_R_RES_ACK;
#else
	UEP_CTRL_TX(0) = USBFS_UEP_T_RES_NAK | CHECK_USBFS_UEP_T_AUTO_TOG;
	UEP_CTRL_RX(0) = USBFS_UEP_R_RES_ACK | CHECK_USBFS_UEP_R_AUTO_TOG;
#endif
  UEP_CTRL_TX(1) = USBFS_UEP_T_RES_NAK;
  UEP_CTRL_TX(2) = USBFS_UEP_R_RES_ACK;
  UEP_CTRL_TX(3) = USBFS_UEP_T_RES_NAK;
// 	int i;
// 	for( i = 1; i < FUSB_CONFIG_EPS; i++ )
// 	{
// #if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
// 		UEP_CTRL_TX(i) = USBFS_UEP_T_RES_NAK | CHECK_USBFS_UEP_T_AUTO_TOG | USBFS_UEP_R_RES_NAK;  
// #else
// 		UEP_CTRL_TX(i) = USBFS_UEP_T_RES_NAK | CHECK_USBFS_UEP_T_AUTO_TOG;
// 		UEP_CTRL_RX(i) = USBFS_UEP_R_RES_NAK | CHECK_USBFS_UEP_R_AUTO_TOG;
// #endif
// 	}
                                                                    
    for(uint8_t i=0; i< sizeof(USBFSCTX.USBFS_Endp_Busy)/sizeof(USBFSCTX.USBFS_Endp_Busy[0]); i++ )
    {
			USBFSCTX.USBFS_Endp_Busy[ i ] = 0;
    }
}

int USBFSSetup()
{
#if defined (CH5xx)
#ifdef CH57x
	R16_PIN_ALTERNATE |= RB_PIN_USB_EN | RB_UDP_PU_EN;
#else
  R16_PIN_ANALOG_IE |= RB_PIN_USB_IE | RB_PIN_USB_DP_PU;
#endif
#else
	
#ifdef CH32V30x_D8C
  RCC->CFGR2 = RCC_USBHSSRC | RCC_USBHSPLL | 1<< RCC_USBHSCLK_OFFSET | RCC_USBHSPLLSRC | 1 << RCC_USBHSDIV_OFFSET;
  RCC->AHBPCENR |= RCC_USBHSEN;
#else
  // USBPRE[1:0] = 10: Divided by 3 (when PLLCLK=144MHz);
	// Must be done before enabling clock to USB OTG tree.
	RCC->CFGR0 = (RCC->CFGR0 & ~(3<<22)) | (2<<22);
#endif
	RCC->APB2PCENR |= RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOB;
#ifdef CH32X03x
  RCC->APB2PCENR |= RCC_APB2Periph_GPIOC;
#endif
	RCC->AHBPCENR |= RCC_USBFS | RCC_AHBPeriph_DMA1; // USBFS === OTG_FSEN
#endif
#ifdef CH32X03x
#ifdef VDD_5V
  AFIO->CTLR = (AFIO->CTLR & ~(UDP_PUE_MASK | UDM_PUE_MASK | USB_PHY_V33)) | UDP_PUE_10K | USB_IOEN;
#else
  AFIO->CTLR = (AFIO->CTLR & ~(UDP_PUE_MASK | UDM_PUE_MASK )) | USB_PHY_V33 | UDP_PUE_1K5 | USB_IOEN;
#endif
#endif
	// Force module to reset.
	USBFS->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
	USBFS->BASE_CTRL = 0x00;

	USBFS_InternalFinishSetup();

	// Enter device mode.
	USBFS->DEV_ADDR  = 0x00;
	USBFS->INT_FG    = 0xff;
	USBFS->INT_EN    = USBFS_UIE_SUSPEND | USBFS_UIE_TRANSFER | USBFS_UIE_BUS_RST;
	USBFS->BASE_CTRL = USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN | USBFS_UC_DEV_PU_EN;
	USBFS->UDEV_CTRL = USBFS_UD_PD_DIS | USBFS_UD_PORT_EN;

	NVIC_EnableIRQ( USB_IRQn );

#if defined (CH32V30x)
	USBFS->OTG_CR = 0; //Note says only valid on 205, 207, 305, 307. 
#endif
	//printf( "CFGR0: %08x / %08x / %08x\n", RCC->CFGR0, USBFS->BASE_CTRL, USBFS->INT_FG);

	// Actually go on-bus.
	USBFS->BASE_CTRL |= USBFS_UC_DEV_PU_EN;

#if FUSB_IO_PROFILE
	funPinMode( DEBUG_PIN, GPIO_CFGLR_OUT_50Mhz_PP );
#endif

	// Go on-bus.
	return 0;
}

// To TX, you can use USBOTG_GetEPBufferIfAvailable or USBFSD_UEP_DMA( endp )

static inline uint8_t * USBFS_GetEPBufferIfAvailable( int endp )
{
	if( USBFSCTX.USBFS_Endp_Busy[ endp ] ) return 0;
	return USBFSCTX.ENDPOINTS[ endp ];
}

static inline int USBFS_SendEndpoint( int endp, int len )
{
	if( USBFSCTX.USBFS_errata_dont_send_endpoint_in_window || USBFSCTX.USBFS_Endp_Busy[ endp ] ) return -1;
  // This prevents sending while ep0 is receiving
  if( USBFSCTX.USBFS_SetupReqLen > 0 ) return -2;
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
  // Check RB_UIS_SETUP_ACT
  if( (USBFS->INT_ST & 0x80) ) return -3;
#endif
  NVIC_DisableIRQ( USB_IRQn );
	UEP_CTRL_LEN( endp ) = len;
	UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_ACK;
	USBFSCTX.USBFS_Endp_Busy[ endp ] = 0x01;
  NVIC_EnableIRQ( USB_IRQn );
	return 0;
}

static inline int USBFS_SendEndpointNEW( int endp, uint8_t* data, int len, int copy)
{
	if( USBFSCTX.USBFS_errata_dont_send_endpoint_in_window || USBFSCTX.USBFS_Endp_Busy[ endp ] ) return -1;
  // This prevents sending while ep0 is receiving
  if( USBFSCTX.USBFS_SetupReqLen > 0 ) return -2;
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
  // Check RB_UIS_SETUP_ACT
  if( (USBFS->INT_ST & 0x80) ) return -3;
#endif
  if( copy )
  {
    copyBuffer( USBFSCTX.ENDPOINTS[endp], data, len );
    copyBufferComplete();
  }
  else UEP_DMA( endp ) = (uint32_t*)data;
  NVIC_DisableIRQ( USB_IRQn );
	UEP_CTRL_LEN( endp ) = len;
	UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_ACK;
	USBFSCTX.USBFS_Endp_Busy[ endp ] = 0x01;
  NVIC_EnableIRQ( USB_IRQn );
	return 0;
}

static inline int USBFS_SendACK( int endp, int tx )
{
  if( tx ) UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_ACK;
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
  else UEP_CTRL_TX(endp) = ( UEP_CTRL_TX(2) & ~USBFS_UEP_R_RES_MASK ) | USBFS_UEP_R_RES_ACK;
#else
  else UEP_CTRL_RX(endp) = ( UEP_CTRL_RX(2) & ~USBFS_UEP_R_RES_MASK ) | USBFS_UEP_R_RES_ACK;
#endif
	return 0;
}

static inline int USBFS_SendNAK( int endp, int tx )
{
	if( tx ) UEP_CTRL_TX( endp ) = ( UEP_CTRL_TX( endp ) & ~USBFS_UEP_T_RES_MASK ) | USBFS_UEP_T_RES_NAK;
#if defined (CH5xx) || defined (CH32X03x) || defined (CH32V10x)
  else UEP_CTRL_TX(endp) = ( UEP_CTRL_TX(2) & ~USBFS_UEP_R_RES_MASK ) | USBFS_UEP_R_RES_NAK;
#else
  else UEP_CTRL_RX(endp) = ( UEP_CTRL_RX(2) & ~USBFS_UEP_R_RES_MASK ) | USBFS_UEP_R_RES_NAK;
#endif
	return 0;
}
